Repository: 84000/data-translation-memory
Catalog: toh130-v1.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཀྱང་ཁང་པ་བརྩེགས་པ་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞིས་ཡོངས་སུ་བསྐོར་ཏེ་མདུན་དུ་བདར་ནས།
en: All the bodhisattvas also arrived together with the 840 million mansions.

source: ཡོན་ཏན་གྱི་བཀོད་པ་ཆེན་པོ་དང་ལྡན་པས་ཤིན་ཏུ་ལྷག་གེའོ། །
en: This great display of qualities was absolutely resplendent.

source: ཁང་པ་བརྩེགས་པ་དེ་དག་གི་འོད་ཀྱིས་ཀྱང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་སྣང་བས་ཁྱབ་པར་གྱུར་ཏོ། །
en: The light that shone from the mansions pervaded this entire trichiliocosm.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་གཉིས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་ནས། །
en: Then the two bodhisattvas went before the Blessed One, the thus-gone, worthy, completely perfect Buddha Śākyamuni.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ། ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: They prostrated with their heads at the feet of the Blessed One, the thus-gone, the worthy, completely perfect Buddha Śākyamuni, and circumambulated him three times before standing off to one side.

source: ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས། །
en: As they stood there,

source: སྐྱེས་བུ་དམ་པ་དེ་གཉིས་ཀྱིས་
en: those two holy beings,

source: ཚིག་འཐུན་པར་སྒྲ་དབྱངས་གཅིག་ཏུ་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ། །
en: in a single tune and a single voice, praised the Blessed One with these verses:

source: གཟི་བརྗིད་མཚུངས་མེད་ཡོན་ཏན་ཕུང་པོ་གཅིག་ལ་ཕྱག་འཚལ་ལོ། །
en: “We prostrate to your unrivaled splendor, your mass of qualities!

source: དྲང་སྲོང་ཆེན་པོ་ཀུན་མཁྱེན་ཡོན་ཏན་ཀུན་གྱི་ཕ་རོལ་གཤེགས། །
en: Great Omniscient Sage, you have perfected all good qualities.

source: ཐམས་ཅད་ཟིལ་གནོན་སྲིད་པ་གསུམ་གྱི་ཆགས་པའི་ལམ་ལས་འདས། །
en: You outshine everyone and transcend the desirous path of the three realms.

source: ཤཱཀྱ་ཁྱུ་མཆོག་དྲི་བྲལ་ཟླ་བའི་ཞལ་ལ་ཕྱག་འཚལ་ལོ། །
en: Supreme leader of the Śākyas, we prostrate before your stainless, moon-like face.

source: ཉི་མ་དྲི་མེད་ལྟ་བུའི་སྐུ་དང་ལྡན་པ་རྣམ་པར་མཛེས། །
en: “Your body is beautiful, like the stainless sun.

source: མཚན་མཆོག་སུམ་ཅུ་རྩ་གཉིས་དག་གི་གོ་ཆ་མནབས་གྱུར་ཅིང་། །
en: You wear the armor of the thirty-two perfect signs,

source: དཔེ་བྱད་བཟང་པོ་རྣམས་ཀྱིས་སྤྲས་པ་འཇིག་རྟེན་ཀུན་ཏུ་གསལ། །
en: And light up the world with your adornments, the excellent marks.

source: མི་མཆོག་ཁྱོད་མཚུངས་འཇིག་རྟེན་གསུམ་ན་གང་ཡང་ཡོད་མ་མཆིས། །
en: Perfect man, no one in the three worlds can compare to you.

source: བདེ་བར་གཤེགས་པའི་སྐུ་ཡི་འོད་ཀྱིས་གང་ཚེ་རེག་གྱུར་པ། །
en: “When faced by the light from the body of the Blissful One,

source: དེ་ཚེ་འཇིག་རྟེན་ཉི་མ་ཟླ་བ་ནོར་བུ་ཞུགས་རྣམས་དང་། །བརྒྱ་བྱིན་ཚངས་པ་ལྷ་དང་དེ་བཞིན་མི་ཅི་རྣམས་ཀྱི་འོད། །
en: The light of the sun, the moon, every jewel and fire in the world, That of any human, or gods like Śakra and Brahmā,

source: སྣག་ཚའི་ཕུང་པོ་བཞིན་དུ་མོག་མོག་མི་སྣང་གསལ་མ་མཆིས། །
en: Is eclipsed, dimmed, and shines no more than a pool of ink.

source: རྒྱལ་བ་ཞིང་གཅིག་ན་ནི་ཡང་དག་བཞུགས་པར་གདའ་བཞིན་དུ། །འགྲོ་བའི་དོན་དུ་སྐད་ཅིག་གཅིག་གིས་མཐའ་ཡས་ཞིང་དུ་གཤེགས། །
en: “Victorious One, while present in one realm, You instantaneously go to limitless others for the sake of beings.

source: སྟོན་པའི་བཞུད་དང་བྱོན་པ་འཚལ་བ་སུ་ཡང་ཡོད་མ་མཆིས། །
en: No one can comprehend the departure and arrival of the teacher.

source: མཛད་པ་དག་དང་འདུལ་བ་སྣ་ཚོགས་དག་གིས་སེམས་ཅན་འདུལ། །
en: Your many deeds and disciplines tame beings.

source: སྤུ་ཡི་ཁུང་གཅིག་ནང་དུ་མཐའ་ཡས་ཞིང་རྣམས་སྟོན་མཛད་ཀྱང་། །
en: “In a single pore you can display limitless realms,

source: འཕེལ་བ་དང་ནི་བྲི་བར་གྱུར་པ་གང་ཡང་ཡོད་མ་མཆིས། །
en: Yet nothing increases or decreases.

source: འདི་ནི་ཇི་བཞིན་ལས་དང་བྱེད་པ་རྒྱུ་དང་འབྲས་གདའ་ལ། །
en: This is beyond the workings of karma, cause and effect.

source: སེམས་ཅན་རྣམས་ལ་གནོད་པ་མ་མཆིས་འདྲེས་པར་གྱུར་མ་མཆིས། །
en: No being is harmed, and nothing is confused.

source: གང་ན་སེམས་ཅན་དམྱལ་བ་དུད་འགྲོ་ཡི་དགས་མ་མཆིས་ཤིང་། །རྒྱལ་བའི་སྲས་པོ་གྲགས་པ་ཆེན་པོ་དག་གིས་ཡོངས་གང་ལ། །མི་ཁོམ་བརྒྱད་པོ་དག་དང་བྲལ་ཏེ་མཆོག་ཏུ་ཉམས་དགའ་བའི། །ཡོངས་དག་ཞིང་དེ་དག་ཀྱང་མི་མཆོག་ལ་ལར་སྟོན་པ་མཛད། །
en: “To some supreme beings you display the pure lands, Where there are no hell beings, animals, or pretas, And which are full of the renowned sons of the victorious ones— A realm of perfect delight beyond the eight unfree states.

source: ལྷ་མི་གང་དག་མི་འཇིགས་བག་མ་མཆིས་པ་བཀང་སླད་དུ། །སེམས་དམྱལ་དུད་འགྲོ་ཡི་དགས་འགྲོ་བ་ཤིན་ཏུ་མི་བཟད་པའི། །ཀུན་ནས་ཉོན་མོངས་ཞིང་རྣམས་ལ་ལ་དག་ཀྱང་བསྟན་མཛད་ནས། །
en: “To remedy others, gods and humans lacking fear and careless in their ways, Once you show them the unbearably afflicted realms, The states to which they could go as hell beings, animals, and pretas,

source: དེ་དག་ཐམས་ཅད་བདེ་བར་གཤེགས་ལ་སྐྱབས་སུ་ཉེ་བར་མཆི། །
en: They all take refuge fully in the Blissful One.

source: ཞིང་གཞན་དག་ཀྱང་ཆབ་ཀྱིས་ཡོངས་སུ་གཏམས་པར་སྟོན་པ་མཛད། །
en: You manifest by filling other realms with water—

source: རྣམ་འཕྲུལ་འདི་ནི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཡུལ་ལགས་སོ། །
en: These emanations are the domain of omniscient wisdom.

source: ཞིང་གཞན་ལ་ལ་དག་ཀྱང་ནམ་མཁའ་ལྟ་བུར་སྟོན་པར་མཛད། །
en: “In some other realms you manifest in the form of space;

source: དེ་བཞིན་གཞན་ཡང་ཞུགས་ཀྱིས་གཏམ་ཞིང་མེ་ལྕེ་འཁྲུགས་པ་དང་། །
en: Likewise, in other realms you blaze in the form of fire and flames.

source: སུམ་ཅུ་རྩ་གསུམ་དབང་ཕྱུག་མིག་སྟོང་རྡོ་རྗེ་འབར་བ་དང་། །
en: the Lord of the Heaven of the Thirty-Three, the thousand-eyed blazing vajra.

source: འདུལ་བའི་དོན་དུ་གཟུགས་ཀྱི་རྣམ་པ་མཐའ་ཡས་སྟོན་མཛད་པ།
en: “In order to tame others you display limitless forms.

source: ལ་ལར་འདོད་པའི་དབང་ཕྱུག་འོད་ཆགས་གཟུགས་དང་ལྡན་པར་འགྱུར། །
en: To some you appear in the shining form of the Lord of Desire,

source: སྲོག་ཆགས་བརྒྱ་ཕྲག་མང་པོ་རབ་ཏུ་དགའ་བས་མཆོད་བགྱིད་ཅིང་། །
en: “Many hundreds of beings are delighted and worship you;

source: ཚངས་པའི་བདག་པོ་མཆོག་ཏུ་ཞི་བའི་ཏིང་འཛིན་རྙེད་པ་དང་། །
en: Lord of the Brahma realm who attained the supremely peaceful absorption,

source: བསྡུ་བའི་དངོས་པོ་བཞི་པོས་སེམས་ཅན་རྣམས་ནི་སྡུད་བགྱིད་ཅིང་། །རྫོགས་པའི་བྱང་ཆུབ་ལམ་ལ་སེམས་ཅན་རབ་ཏུ་འཇོག་བགྱིད་པ། །
en: “With the four means of attracting disciples, you gather beings And establish them on the path to perfect awakening.

source: དགེ་བ་བཅུ་པོ་དག་གིས་སེམས་ཅན་མཐའ་ཡས་འདུལ་བགྱིད་པ། །
en: Through the ten virtues, limitless beings are tamed.

source: བློན་པོ་ཚོང་དཔོན་དག་དང་བཀའ་ལ་གཏོགས་པའི་གཙོར་གྱུར་ཅིང་། །
en: You are supreme among ministers, merchants, and royal counselors;

source: ཤིན་ཏུ་འཇིགས་མེད་དགྲ་ཚོགས་ཕབ་ནས་ཆད་པས་མི་གཅོད་ལ། །
en: Fearless when enemies descend, you are unharmed by their attacks.

source: འཇིག་རྟེན་འདི་ན་ལ་ལར་བལྟམ་པ་ལྟ་བུར་སྟོན་མཛད་དེ། །དོག་ས་ལ་ནི་གོམ་པ་བདུན་དག་བོར་ཞིང་གཤེགས་ནས་ཀྱང་། །
en: “To some, here in this world, you demonstrated birth, And taking seven steps over the ground,

source: བསོད་ནམས་ལས་ཀྱིས་རིན་ཆེན་བདུན་དང་ལྡན་པར་གྱུར་པ་ཡི། །གླིང་བཞི་དག་གི་དབང་ཕྱུག་འཁོར་ལོས་སྒྱུར་བ་དག་ཏུ་གྱུར། །
en: Through meritorious action you become a universal monarch Who masters the four continents in possession of the seven riches.

source: ང་ནི་སྐྱེས་ནས་སྐྱེ་དང་འཆི་བའི་ཐ་མར་དབྱུང་ངོ་ཞེས། །ཡིད་འོང་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་གསུང་མཆོག་བརྗོད་པ་མཛད། །
en: With your beautiful voice endowed with eight aspects, you said: ‘This birth of mine will bring an end to birth and death.’

source: མར་མེ་མཛད་པ་ཚུན་ཆད་དྲི་མ་ཐམས་ཅད་སྤང་ལགས་ཀྱང་། །
en: “During the time of Dīpaṃkara you had abandoned all defilements,

source: ཡབ་ཡུམ་དག་དང་གཉེན་གྱི་རྩ་ལག་སྡུག་པའི་འཁོར་རྣམས་དང་། །ཡུལ་འཁོར་འབྱོར་དང་རིན་ཆེན་གཏེར་མཛོད་མང་པོ་བཏང་མཛད་ནས། །
en: “You gave up your parents, your cherished retinue of friends and relatives, Your kingdom, wealth, and many treasuries of jewels.

source: འགྲོ་རྣམས་སངས་རྒྱས་ཡེ་ཤེས་མཆོག་ལ་ཡོངས་སྨིན་མཛད་སླད་དུ། །
en: And yet, to ripen beings for the supreme wisdom of awakening,

source: ལ་ལར་སེམས་ཅན་དག་པ་བཙུན་མོའི་འཁོར་ན་བཞུགས་པར་གདའ།
en: To some you stayed, a pure being, amidst a retinue of queens. Lord of Men,

source: བརྒྱ་བྱིན་ཚངས་པ་དག་དང་ལྷ་མིན་རྣམས་ཀྱིས་ཕྱག་བགྱིས་ཤིང་། །
en: Śakra, Brahmā, and the demigods revered you;

source: མི་ཡི་དབང་པོ་བཙུན་མོ་དག་དང་སྲས་ཀྱང་སྟོན་པ་མཛད། །
en: you also taught the queens and your son.

source: དྲང་སྲོང་ཆེན་པོ་མངོན་པར་བྱུང་སྟེ་ནགས་ན་བཞུགས་པར་གདའ།
en: Great Sage, you left home and lived in the forest.

source: འགྲོ་ལ་སྨན་སླད་དགུང་ལོ་དྲུག་ཏུ་དཀའ་བ་སྤྱད་ནས་ནི། །
en: “To benefit beings, for six years you underwent hardship,

source: བསམ་གཏན་མཁའ་ཁྱབ་རིན་ཆེན་མཆོག་ལ་བསམ་གཏན་མཛད་པར་གདའ། །
en: Focused in supreme and precious all-pervasive concentration.

source: མུ་སྟེགས་ཅན་གྱི་ཚོགས་རྣམས་ཐམས་ཅད་ཚར་གཅད་མཛད་སླད་དུ། །
en: In order to defeat all the hordes of extremists,

source: སེམས་ཅན་དག་པ་བྱང་ཆུབ་ཤིང་དྲུང་དུ་ཡང་གཤེགས་པར་གདའ། །
en: You, a pure being, went to the foot of the Bodhi tree.

source: འགྲོ་རྣམས་སངས་རྒྱས་ཡེ་ཤེས་མཆོག་ཏུ་ཡོངས་སྨིན་མཛད་སླད་དུ། །
en: “In order to ripen beings for the supreme wisdom of a buddha,

source: མི་དབང་སྒྱུ་མ་ལྟ་བུའི་ཏིང་འཛིན་མཆོག་ལ་བཞུགས་མཛད་ནས། །
en: Lord of Men, you entered into the supreme illusory absorption;

source: སྐུ་ཡི་ཚུལ་ནི་གང་གིས་འཇིག་རྟེན་རྣམ་པར་འདུལ་འགྱུར་བ། །རྒྱལ་བ་དེ་འདྲ་ཉིད་ཀྱི་སྐུ་ཡི་ཆ་ལུགས་འཛིན་པར་མཛད། །
en: Victorious One, you took on a physical appearance Of such a kind that would tame the world.

source: ཇི་ལྟར་སྒྱུ་མ་མཁན་གྱིས་འགྲོ་བ་རྨོངས་པར་བགྱི་སླད་དུ། །སྒྱུ་མ་མང་པོའི་རྣམ་པར་འཕྲུལ་པ་རབ་ཏུ་སྟོན་བགྱིད་པ། །
en: “Just as an illusionist, in order to trick others, Will produce many illusory manifestations,

source: དེ་བཞིན་འགྲོ་བ་སྒྲོན་མས་སེམས་ཅན་འདུལ་བར་མཛད་སླད་དུ། །སངས་རྒྱས་ཉིད་ཀྱི་རྣམ་པར་འཕྲུལ་པ་མང་པོ་རྣམས་ཀྱང་སྟོན། །
en: so too, you, Lamp of the World, in order to tame beings Produced the many manifestations of your buddhahood.

source: ཐུབ་པ་དཔའ་བོ་ལ་ལར་དཔུང་དང་བཅས་པའི་བདུད་འདུལ་སྟོན། །
en: “Heroic Sage, to some you showed the taming of Māra and his armies,

source: གང་ལ་ཕ་རོལ་མུ་སྟེགས་ཚོགས་ཀྱི་འགྲོ་བ་མ་མཆིས་ཤིང་། །
en: And did what no one else out of all the extremist hosts has done:

source: རྡུལ་བྲལ་མྱ་ངན་མ་མཆིས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པ། །
en: You attained immaculate omniscience beyond nirvāṇa,

source: བླ་ན་མེད་པ་འགྱུར་བ་མ་མཆིས་འཁོར་ལོ་རབ་ཏུ་བསྐོར། །
en: And turned the unsurpassable and unchanging wheel.

source: ཁྱོད་ཀྱིས་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་མང་ནས་བྱང་ཆུབ་བརྙེས། །
en: “Over many billions of eons you discovered awakening;

source: ཕྱོགས་ཀྱི་ལམ་རྣམས་ཐམས་ཅད་དུ་ཡང་འཁོར་ལོ་བསྐོར་བ་མཛད། །
en: On all paths you turned the wheel.

source: མི་ཡི་དབང་པོ་ཀུན་ནས་ཞལ་ལྡན་ཆུ་ཟླ་བཞིན་དུ་བཞུགས། །
en: Lord of Men, like a moon reflected in water, you appear to all;

source: བདེ་གཤེགས་རང་བྱུང་མཐའ་ཡས་ཡུལ་ལ་བདག་ཅག་ཕྱག་འཚལ་ལོ། །
en: Self-Originated Blissful One in infinite places, we prostrate to you.

source: ལ་ལ་དག་ལ་སངས་རྒྱས་ཆོས་ཀྱི་སྐུ་ནི་སྟོན་མཛད་པ། །
en: “To some, you show the Dharma body of a Buddha,

source: རྟག་པ་བརྟན་པ་ཐེར་ཟུག་འགྱུར་བ་མ་མཆིས་གྱུར་པ་དང་། །མ་བགྱིས་མ་སྐྱེས་དྲི་མ་མ་མཆིས་འགོག་པ་མ་མཆིས་ཆོས། །
en: The permanent, stable, enduring, unchanging, Immutable, unborn, stainless, and unceasing Dharma.

source: མིག་ཡོར་འདྲ་བས་ཕྱོགས་བཅུ་དག་ནི་ཤིན་ཏུ་རྒྱས་པར་འགེངས། །
en: It pervades all the ten directions, which are like an optical illusion.

source: རིང་པོར་མི་ཐོགས་པར་ནི་སྡུག་པ་དག་དང་འབྲལ་འགྱུར་གྱིས། །འདུས་བྱས་འདི་ལ་ཁྱེད་ཅག་ཡིད་བརྟན་བྱ་བའི་མི་རིགས་ཞེས། །
en: ‘In no time at all, you will be separated from your loved ones, So it is no good for you to put your trust in this compounded world.’

source: འགྲོ་བ་ཐམས་ཅད་རྨི་ལམ་སྒྱུ་མ་སྨིག་རྒྱུ་འདྲ་བ་དང་། །མི་རྟག་མི་བརྟན་སྐད་ཅིག་པར་ཡང་ལ་ལ་དག་ལ་སྟོན། །
en: you show them how all beings are like a dream, an illusion, a mirage, And impermanent, unstable, and momentary.

source: བདེ་གཤེགས་སྐུ་ཡི་ཕྲིན་ལས་མཐའ་དང་ཕ་རོལ་ཡོད་མ་མཆིས། །
en: “The physical activity of the Blissful One knows no bounds or borders;

source: གསུང་དང་ཐུགས་ཀྱི་འཇུག་པའི་སྤྱོད་ཡུལ་དག་ཀྱང་དཔག་མི་ལང་།
en: The domains of your verbal and mental activity are also unfathomable.

source: ནམ་མཁའ་ལྟ་བུར་རྒྱ་ཆེ་ཚད་མ་མཆིས་པ་སྟོན་མཛད་དེ། །
en: Like the sky, the deeds of the Teacher are impossible to measure;

source: རྒྱལ་བའི་སྤྱོད་ཡུལ་སེམས་ཅན་རྣམས་ཀྱིས་འཚལ་བར་ནུས་མ་ལགས། །
en: The domain of the Victorious One cannot be understood by sentient beings.

source: ཕྱོགས་བཅུ་དག་ན་མཆིས་པའི་སེམས་ཅན་མ་ལུས་ཇི་སྙེད་པ། །དེ་དག་ཤཱ་རིའི་བུ་དང་འདྲ་བར་ཤེས་རབ་ལྡན་གྱུར་ཀྱང་། །
en: “Even if all the beings throughout the ten directions Were as knowledgeable as Śāriputra,

source: རྒྱལ་བ་ཆོས་ཀྱི་རྒྱལ་པོའི་དངོས་པོའི་ཡུལ་ཚད་མ་མཆིས་པ། །རྒྱལ་བའི་སྤྱོད་ཡུལ་ཐམས་ཅད་དེ་དག་རྣམས་ཀྱིས་རིག་མི་ནུས། །
en: They could not fathom the limitless scope of the victorious Dharma King’s nature, Nor the entirety of the Victorious One’s domain.

source: རྫོགས་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་མཁའ་འདྲ་ཕ་རོལ་མཐའ་མ་མཆིས།
en: “The wisdom of the perfect Buddha is limitless like the sky,

source: དེ་ལྟར་རྒྱལ་བའི་ཡུལ་ནི་བསམ་གྱིས་མི་ཁྱབ་མ་ལུས་པ། །
en: And the experience of the victorious ones is entirely inconceivable.

source: འདི་ན་རྒྱལ་བའི་སྲས་རྣམས་ཀུན་དང་ཉན་ཐོས་རྣམས་དང་ནི། །རྐྱེན་གྱི་རྒྱལ་བ་འདུས་པ་རྣམས་ཀྱིས་འཚལ་བར་ནུས་མ་ལགས། །
en: The assemblies of sons of the victorious ones, hearers, And circumstantial victorious ones cannot comprehend it.

source: དེ་ལྟར་འདི་དག་ལ་སོགས་མཐའ་ཡས་ཐབས་དང་ལྡན་པ་ཡི། །འདུལ་བའི་དོན་དུ་སྐུ་ཡི་མཛད་པ་མཐའ་ཡས་སྟོན་པར་མཛད། །
en: “Thus you show them boundless physical deeds, Skillfully performed to tame infinite beings.

source: ནམ་མཁའི་ཁམས་དང་མཚུངས་པར་མཐའ་ཡས་སྐུ་དང་ལྡན་གྱུར་པ། །
en: You have bodies as infinite as the element of space.

source: མགོན་པོ་རྟོག་དང་རྣམ་པར་རྟོག་དང་བྲལ་ལ་ཕྱག་འཚལ་ལོ། །
en: Protector devoid of concept and thought, we prostrate to you.

source: ཉོན་མོངས་ཐུལ་བ་རྒྱལ་བ་འགྲོ་བའི་གཙོ་ལ་བསྟོད་པ་ཡི། །
en: We praise you, Victorious One, tamer of disturbing emotions, and foremost being.

source: སྡུག་བསྔལ་རྒྱ་མཚོ་རྒྱ་ཆེན་ཕ་རོལ་རབ་ཏུ་རྒལ་གྱུར་པ། །
en: “You have crossed to the other shore of the vast ocean of suffering.

source: བསོད་ནམས་ཅི་མཆིས་དེས་ནི་འདི་ན་འགྲོ་བ་མ་ལུས་པ། །བྱང་ཆུབ་རིན་ཆེན་རབ་མཆོག་ཞི་ཞིང་བདེ་ལ་རེག་པར་ཤོག །
en: May all the merit gained thereby go to all beings So that they may reach precious, supreme, peaceful, and blissful awakening!”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཐུ་ཆེན་ཐོབ་ཀྱིས་ཚུལ་དང་འཐུན་པའི་ཚིགས་སུ་བཅད་པ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བསྟོད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: When the bodhisattva great being Avalokiteśvara and the bodhisattva great being Mahā­sthāmaprāpta had praised the Blessed One with these fitting verses, they asked the Blessed One about his health, saying,

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་དཔག་མེད་བཅོམ་ལྡན་འདས་ལ་གནོད་པ་ཆུང་ངམ་ཞེས་སྙུན་གསོལ་ལོ། །
en: “The Blessed One, the thus-gone, worthy, completely perfect Buddha Amitābha is asking if the Blessed One is in good health.

source: ཉམ་ང་བ་ཉུང་ངམ། བསྐྱོད་པ་ཡང་ངམ། །
en: Are you free from any misfortune and agitation?

source: སྟོབས་དང་བདེ་བར་རེག་པ་ལ་གནས་སམ་ཞེས་ཀྱང་སྙུན་གསོལ་ལོ། །
en: Are you enjoying good health and well-being?”

source: འདི་སྐད་ཅེས་བཅོམ་ལྡན་འདས་ཀྱི་ཉན་ཐོས་དག་འཇིག་རྟེན་གྱི་ཁམས་ཉམས་དགའ་བ་ལ་བལྟར་སྩོལ་ཅིག་ཅེས་ཀྱང་གསུང་ངོ་།
en: They also said, “Hearers of the Blessed One, behold how delightful the world has become.”

source: དེ་ནས་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིའི་བྱང་ཆུབ་སེམས་དཔའ་དང་། ཉན་ཐོས་ཆེན་པོ་དེ་དག་གིས་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཁང་པ་བརྩེགས་པའི་བཀོད་པ་ཆེན་པོ་དེས་ཡོངས་སུ་ཁྱབ་པ་དང་།
en: When the bodhisattvas and great hearers here in the Sahā world saw the great display of mansions that pervaded this entire world,

source: རིན་པོ་ཆེ་སྣ་ཚོགས་དག་ཀྱང་མཐོང་ནས་ངོ་མཚར་དུ་འཛིན་ཅིང་དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ། །
en: as well as its many riches, they were amazed and thought to themselves,

source: གང་དག་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་ནས་འདིར་ལྷགས་པ་འདི་དག་ཅི་དེ་བཞིན་གཤེགས་པའི་མཐུའམ། འོན་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་དག་གི་མཐུ་ཡིན་སྙམ་མོ།
en: “Is it due to the power of the Thus-Gone One, or is it due to the power of these bodhisattva great beings, that all of this has arrived here from the world of Sukhāvatī?”

source: དེ་ནས་དེའི་ཚེ་སངས་རྒྱས་ཀྱི་མཐུས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་པད་མའི་དཔལ་གྱི་སྙིང་པོས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: At that point, inspired by the Buddha, the bodhisattva great being Padmaśrīgarbha asked the Blessed One,

source: འདི་ལྟར་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདི་ཁང་པ་བརྩེགས་པ་སྣ་ཚོགས་དུ་མས་བརྒྱན་ཅིང་ཡོངས་སུ་ཁྱབ་པར་གདའ་བ་ནི་བཅོམ་ལྡན་འདས་ངོ་མཚར་ཏོ། །བདེ་བར་གཤེགས་པ་མཆོག་ཏུ་ངོ་མཚར་ཏོ། །
en: “Blessed One, all these many mansions that now fill up and adorn this Sahā world are amazing! Blissful One, they are truly amazing!

source: གང་དག་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་ནས་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་ལྷགས་པ་དག་ཅི་དེ་བཞིན་གཤེགས་པའི་མཐུ་ལགས་སམ། འོན་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་གི་མཐུ་ལགས།
en: Did all of this arrive here in the Sahā world from the world of Sukhāvatī due to the power of the Thus-Gone One or due to the power of these bodhisattvas?”

source: པད་མའི་དཔལ་གྱི་སྙིང་པོ་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདི་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཁང་པ་བརྩེགས་པ་དུ་མས་བརྒྱན་ཅིང་ཡོངས་སུ་ཁྱབ་པར་སྣང་བ་འདི་ནི་དེ་བཞིན་གཤེགས་པའི་མཐུ་མ་ཡིན་གྱི།
en: “Padmaśrīgarbha, that these many jewel mansions now fill up and adorn this Sahā world is not due to the power of the Thus-Gone One.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཐུ་ཆེན་ཐོབ་ཀྱི་མཐུ་ཡིན་ནོ།
en: Rather, it is due to the power of the bodhisattva great being Avalokiteśvara and the bodhisattva great being Mahā­sthāmaprāpta.”

source: མཐུས་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདི་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཁང་པ་བརྩེགས་པ་དུ་མས་བརྒྱན་ཅིང་ཡོངས་སུ་ཁྱབ་པར་གདའ་བ་
en: “Because of their power, this Sahā world is now filled and adorned with these many jewel mansions.

source: སྐྱེས་བུ་དམ་པ་འདི་གཉིས་ཀྱི་སྨོན་ལམ་དག་དང་། དགེ་བའི་རྩ་བ་དག་ཡོངས་སུ་སྦྱངས་པ་བསམ་གྱིས་མི་ཁྱབ་སྟེ། བཅོམ་ལྡན་འདས་ངོ་མཚར་ཏོ། །
en: The perfection of the aspirations and roots of virtue of these two holy beings is inconceivable! Blessed One, it is amazing!

source: བདེ་བར་གཤེགས་པ་མཆོག་ཏུ་ངོ་མཚར་ཏོ། །
en: Blissful One, it is truly amazing!”

source: པད་མའི་དཔལ་གྱི་སྙིང་པོ་ཇི་སྐད་སྨྲས་པ་དེ་དེ་བཞིན་ཏེ།
en: “Padmaśrīgarbha, it is just as you say,” said the Blessed One.

source: སྐྱེས་བུ་དམ་པ་འདི་གཉིས་ནི་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གྲངས་མེད་པ་ནས་དགེ་བའི་རྩ་བ་དག་ཡོངས་སུ་སྦྱངས་པ་ཡིན་ནོ། །
en: “For innumerable trillions of eons, these two holy beings have perfected the roots of virtue.

source: པད་མའི་དཔལ་གྱི་སྙིང་པོ་སྐྱེས་བུ་དམ་པ་འདི་གཉིས་ནི་སྒྱུ་མ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ཐོབ་པ་ཡིན་ཏེ།
en: Padmaśrīgarbha, these two holy beings have attained the illusory absorption.

source: འདི་གཉིས་སྒྱུ་མ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ལ་གནས་ནས།
en: As they abide within the illusory absorption,

source: རྫུ་འཕྲུལ་གྱི་རྣམ་པར་སྤྲུལ་པ་འདི་ལྟ་བུ་འདི་དག་སྟོན་ཏོ། །
en: they can demonstrate such miraculous emanations.

source: པད་མའི་དཔལ་གྱི་སྙིང་པོ་ཁྱོད་ཤར་གྱི་ཕྱོགས་ཆ་ལོགས་སུ་དེ་ན་ཅི་སྣང་ལྟོས་ཤིག
en: Padmaśrīgarbha, when you look toward the east, what do you see?”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་པད་མའི་དཔལ་གྱི་སྙིང་པོས་བྱང་ཆུབ་སེམས་དཔའི་ལྷའི་མིག་སྒྲིབ་པ་མེད་པས་བལྟས་ན་
en: When the bodhisattva great being Padmaśrīgarbha looked toward the east with the unobscured divine eye of a bodhisattva,

source: ཤར་ཕྱོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་མཐོང་ངོ་།
en: he saw as many buddha realms as there are grains of sand in the river Ganges, with as many blessed buddhas as there are grains of sand in the river Ganges.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་ཀྱི་ཞབས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཐུ་ཆེན་ཐོབ་གཉིས་ཕྱག་འཚལ་ནས་ཚིག་འདི་སྐད་ཅེས།
en: At the feet of all of those blessed buddhas were the bodhisattva great being Avalokiteśvara and the bodhisattva great being Mahā­sthāmaprāpta, prostrating and inquiring about their health, saying,

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་དཔག་མེད། བཅོམ་ལྡན་འདས་ལ་གནོད་པ་ཆུང་ངམ་ཞེས་སྙུན་གསོལ་ལོ། །
en: “The Blessed One, the thus-gone, worthy, completely perfect Buddha Amitābha is asking if the Blessed One is in good health.

source: སྟོབས་དང་བདེ་བར་རེག་པ་ལ་གནས་སམ་ཞེས་ཀྱང་སྙུན་གསོལ་ལོ་ཞེས་སྨྲའོ། །
en: Are you enjoying good health and well-being?”

source: དེ་བཞིན་དུ་ལྷོའི་ཕྱོགས་ཆ་དང་། དེ་བཞིན་དུ་ནུབ་དང་། དེ་བཞིན་དུ་བྱང་དང་། དེ་བཞིན་དུ་འོག་དང་། དེ་བཞིན་དུ་སྟེང་དང་། དེ་བཞིན་དུ་ཕྱོགས་བཅུ་ཀུན་ཏུ་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ན་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཁང་པ་བརྩེགས་པའི་བཀོད་པ་ཆེན་པོ་དུ་མས་བརྒྱན་ཅིང་ཡོངས་སུ་ཁྱབ་པར་མཐོང་ངོ་། །
en: The same thing occurred in the south, in the west, in the north, below, above, and in all the ten directions. In all directions Padmaśrīgarbha saw as many buddha realms as there are grains of sand in the Ganges River, filled with and adorned by a great display of mansions made of various precious substances.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཐམས་ཅད་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དག་ཀྱང་མཐོང་ངོ་། །
en: In all those buddha realms he saw blessed buddhas,

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་ཀྱི་སྤྱན་སྔ་ན་སྐྱེས་བུ་དམ་པ་དེ་གཉིས་ཞབས་ལ་ཕྱག་འཚལ་བར་ཡང་མཐོང་ངོ་།
en: he witnessed the two holy beings prostrating before all those blessed buddhas.

source: མཐོང་ནས་ཀྱང་དེ་ཤིན་ཏུ་ངོ་མཚར་ཆེར་འཛིན་པར་གྱུར་ཏོ། །
en: As he saw this, he was filled with great wonder.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་པད་མའི་དཔལ་གྱི་སྙིང་པོ་ངོ་མཚར་དུ་གྱུར་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The bodhisattva great being Padmaśrīgarbha was amazed, and exclaimed to the Blessed One,

source: སྐྱེས་བུ་དམ་པ་འདི་གཉིས་ཀྱིས་སྒྱུ་མ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་མངོན་པར་བསྒྲུབས་པ་ནི་བསམ་གྱིས་མི་ཁྱབ་
en: “The accomplishment of the illusory absorption by these two holy beings is inconceivable!

source: བཅོམ་ལྡན་འདས་ངོ་མཚར་ཏོ། །བདེ་བར་གཤེགས་པ་མཆོག་ཏུ་ངོ་མཚར་ཏོ། །
en: Blessed One, it is amazing! Blissful One, it is truly amazing!

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why do I say so?

source: འདི་ལྟར་སྐྱེས་བུ་དམ་པ་འདི་གཉིས་ཏིང་ངེ་འཛིན་འདི་ལ་གནས་ཏེ། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ན་གདའ་བའི་སླད་དུའོ། །
en: Because these two holy beings abide in that absorption, and thus are present in all buddha realms.”

source: དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཇི་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་མངོན་པར་མཛད་པས། བྱང་ཆུབ་སེམས་དཔའ་པད་མའི་དཔལ་གྱི་སྙིང་པོས་ཕྱོགས་བཅུ་ཀུན་གྱི་སངས་རྒྱས་ཀྱི་ཞིང་དག་མཐོང་བ་དང་།
en: The Blessed One then produced a miraculous display so that the bodhisattva Padmaśrīgarbha could see the buddha realms in all ten directions.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དག་དང་སྐྱེས་བུ་དམ་པ་དེ་གཉིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་བ་མཐོང་བ་དང་།
en: He could also behold blessed buddhas in those buddha realms, and he saw how the two holy beings prostrated at the feet of the blessed ones.

source: དེ་བཞིན་དུ་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེས་ཀྱང་ཕྱོགས་བཅུ་ཀུན་གྱི་སངས་རྒྱས་ཀྱི་ཞིང་དག་མཐོང་བ་དང་། །
en: In a similar way, the entire retinue present could see the buddha realms in all ten directions,

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དག་དང་། སྐྱེས་བུ་དམ་པ་དེ་གཉིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དག་གི་ཞབས་ལ་ཕྱག་འཚལ་བ་མཐོང་བ་དང་། །
en: behold the blessed buddhas in those buddha realms, and see the two holy beings prostrated at the feet of the blessed ones.

source: མཐོང་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་འཁོར་སྲོག་ཆགས་སུམ་ཁྲི་ཉིས་སྟོང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་མངོན་པར་མཛད་དོ།
en: Witnessing this, thirty-two thousand beings in the retinue of the Blessed One developed the mind set on unsurpassed and completely perfect awakening. Such were the miracles that the Blessed One produced.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་པད་མའི་དཔལ་གྱི་སྙིང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then the bodhisattva Padmaśrīgarbha asked the Blessed One,
